In [2]:
!pip install pandas
import psycopg2
from psycopg2.extras import DictCursor
import os
import pandas as pd
from matplotlib import pyplot as plt
import seaborn as sns

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.22.4 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.1.3)
Requirement already satisfied: tzdata>=2022.7 in /opt/conda/lib/python3.10/site-packages (from pandas) (2024.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.7.1)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
WARNING: There was an error checking the latest version of pip.

ModuleNotFoundError: No module named 'matplotlib'

In [9]:
sql_host = '10.129.0.25'

In [10]:
def get_query(query: int):
    with psycopg2.connect(
        dbname = 'demo',
        user = os.environ['POSTGRESQL_USER'],
        password = os.environ['POSTGRESQL_PASSWORD'],
        host = sql_host
    )as c:
        with c.cursor() as cur:
            cur.execute(query)
            res = cur.fetchall()
            return res

In [11]:
query = "SELECT DISTINCT arrival_airport, aircraft_code FROM flights f \
        WHERE f.arrival_airport='AER'"
res = get_query(query)
df = pd.DataFrame(res, columns = ['arrival_airport', 'aircraft_code'])
df

  arrival_airport aircraft_code
0             AER           773
1             AER           733
2             AER           763
3             AER           CN1
4             AER           SU9
5             AER           CR2
6             AER           319

In [12]:
query = "SELECT arrival_airport, aircraft_code FROM flights f \
        WHERE f.arrival_airport='AER'"
res = get_query(query)
df = pd.DataFrame(res, columns = ['arrival_airport', 'aircraft_code'])
df

     arrival_airport aircraft_code
0                AER           773
1                AER           CN1
2                AER           763
3                AER           763
4                AER           763
...              ...           ...
3786             AER           CN1
3787             AER           CN1
3788             AER           CN1
3789             AER           CN1
3790             AER           CN1

[3791 rows x 2 columns]

In [13]:
query = "SELECT DISTINCT fare_conditions FROM ticket_flights \
         WHERE flight_id IN( \
             SELECT flight_id FROM flights\
             WHERE arrival_airport = 'SVO' AND departure_airport = 'AER')"
res = get_query(query)

In [14]:
df = pd.DataFrame(res, columns = ['fare_conditions'])
df

  fare_conditions
0        Business
1         Comfort
2         Economy

In [15]:
query = "SELECT DISTINCT model FROM aircrafts \
         WHERE aircraft_code IN( \
             SELECT aircraft_code FROM flights \
             WHERE departure_airport IN (\
                 SELECT airport_code FROM airports\
                 WHERE city = 'Yakutsk'))\
        AND aircraft_code IN(\
            SELECT aircraft_code FROM flights \
             WHERE departure_airport IN (\
                 SELECT airport_code FROM airports\
                 WHERE city = 'Abakan'))"
res = get_query(query)

In [16]:
df = pd.DataFrame(res, columns = ['models'])
df

            models
0  Airbus A319-100

In [17]:
query = "SELECT DISTINCT model FROM aircrafts \
         WHERE aircraft_code IN( \
             SELECT aircraft_code FROM flights \
             WHERE departure_airport IN (\
                 SELECT airport_code FROM airports\
                 WHERE city = 'Yakutsk' OR city = 'Abakan'))"
res = get_query(query)

In [18]:
df = pd.DataFrame(res, columns = ['models'])
df

                models
0      Airbus A319-100
1       Boeing 737-300
2   Bombardier CRJ-200
3   Cessna 208 Caravan
4  Sukhoi Superjet-100

In [19]:
query = "SELECT DISTINCT model FROM aircrafts \
         WHERE aircraft_code NOT IN( \
             SELECT aircraft_code FROM flights \
             WHERE departure_airport IN (\
                 SELECT airport_code FROM airports\
                 WHERE city = 'Yakutsk'))"
res = get_query(query)

In [20]:
df = pd.DataFrame(res, columns = ['models'])
df

               models
0     Airbus A320-200
1     Airbus A321-200
2      Boeing 737-300
3      Boeing 767-300
4      Boeing 777-300
5  Cessna 208 Caravan

In [21]:
query = "SELECT departure_airport, arrival_airport\
         FROM flights \
         WHERE flight_id IN(\
             SELECT flight_id \
             FROM ticket_flights \
             WHERE ticket_no IN (\
                 SELECT ticket_no \
                 FROM tickets \
                 WHERE passenger_name = 'ELLA DMITRIEVA'))"
res = get_query(query)

In [22]:
df = pd.DataFrame(res, columns = ['departure_airport' ,'arrival_airport'])
df

  departure_airport arrival_airport
0               SVO             SVX
1               MQF             SVX
2               SVX             MQF
3               SVX             SVO
4               DME             HMA
5               DME             UUS
6               HMA             DME